In [1]:
import mysql.connector as sql

In [2]:
import pandas as pd

In [3]:
db_connection = sql.connect(host='localhost', database='test', user='root', password='Mysql@123')

In [4]:
print(db_connection)

<mysql.connector.connection_cext.CMySQLConnection object at 0x0000012B0926B908>

In [5]:
db_cursor = db_connection.cursor()

In [6]:
data = db_cursor.execute('SELECT * FROM EMP')

In [7]:
table_rows = db_cursor.fetchall()

In [8]:
df = pd.DataFrame(table_rows)

In [9]:
df

   0    1      2    3
0  0  100  hello  100
1  0  100   test  100

In [10]:
print(table_rows)

[(0, 100, 'hello', '100'), (0, 100, 'test', '100')]

In [11]:
df = pd.read_sql('SELECT * FROM emp', con=db_connection)

In [12]:
df

   index   id emp_name emp_sala
0      0  100    hello      100
1      0  100     test      100

In [13]:
df['id'] = df['id'].replace([1],100)

In [14]:
df

   index   id emp_name emp_sala
0      0  100    hello      100
1      0  100     test      100

In [15]:
#send data back to sql
df.to_sql("emp", db_connection)

DatabaseError: Execution failed on sql 'SELECT name FROM sqlite_master WHERE type='table' AND name=?;': Not all parameters were used in the SQL statement

In [1]:
from sqlalchemy import create_engine

import pymysql

import pandas as pd

 

sqlEngine       = create_engine('mysql+pymysql://root:NewPassword@localhost:3306', pool_recycle=3600)

dbConnection    = sqlEngine.connect()

frame           = pd.read_sql("select * from class.emp", dbConnection);

 

pd.set_option('display.expand_frame_repr', False)

print(frame)

 

#dbConnection.close()

  emp_id emp_name
0      1     test
1      2      try

In [6]:
frame

  emp_id emp_name
0      1     test
1      2      try

In [7]:
frame = frame.reset_index(drop=True)

In [8]:
frame['emp_name'] = frame['emp_name'].replace(["test"],"hello")

In [9]:
frame

  emp_id emp_name
0      1    hello
1      2      try

In [10]:
frame.to_sql(con=dbConnection, schema = "class" , name='emp', if_exists='replace', index=False)

In [12]:
frame['emp_id'] = frame['emp_id'].replace(["1"],"100")

In [13]:
frame

  emp_id emp_name
0    100    hello
1      2      try

In [14]:
frame.to_sql(con=dbConnection, schema = "class" , name='emp', if_exists='append', index=False)

In [22]:
df

   index   id emp_name emp_sala
0      0  100     test      100
1      0  100     test      100